modm-ext/data.modm.io/docs/svd/header_stm32g484xx.svd
        <register>
          <name>SHRR</name>
          <description>DAC Sample and Hold refresh time register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>DAC channel1 refresh time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>DAC channel2 refresh time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STR1</name>
          <description>DAC Sawtooth register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STRSTDATA1</name>
              <description>DAC Channel 1 Sawtooth starting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>STDIR1</name>
              <description>DAC Channel 1 Sawtooth direction setting</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STINCDATA1</name>
              <description>DAC Channel 1 Sawtooth increment value (12.4 bit format)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STR2</name>
          <description>DAC Sawtooth register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STRSTDATA2</name>
              <description>DAC Channel 2 Sawtooth starting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>STDIR2</name>
              <description>DAC Channel 2 Sawtooth direction setting</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STINCDATA2</name>
              <description>DAC Channel 2 Sawtooth increment value (12.4 bit format)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STMODR</name>
          <description>DAC Sawtooth Mode register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STRSTTRIGSEL1</name>
              <description>STRSTTRIGSEL1[3:0] (DAC Channel 1 Sawtooth Increment trigger selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STINCTRIGSEL1</name>
              <description>STINCTRIGSEL1[3:0] (DAC Channel 1 Sawtooth Increment trigger selection)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STRSTTRIGSEL2</name>
              <description>STRSTTRIGSEL2[3:0] (DAC Channel 2 Sawtooth Increment trigger selection)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STINCTRIGSEL2</name>
              <description>STINCTRIGSEL2[3:0] (DAC Channel 2 Sawtooth Increment trigger selection)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC1</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <alternatePeripheral>DAC</alternatePeripheral>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC2</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC3</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC4</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <description>AES hardware accelerator</description>
      <groupName>AES</groupName>
      <baseAddress>0x50060000</baseAddress>
      <interrupt>
        <name>AES</name>
        <description>AES global interrupt</description>
        <value>85</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>AES control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>AES Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATATYPE</name>
              <description>Data type selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>AES Mode Of Operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHMOD</name>
              <description>AES Chaining Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CCFC</name>
              <description>Computation Complete Flag Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRC</name>
              <description>Error Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCFIE</name>
              <description>Computation Complete Flag Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAINEN</name>
              <description>Enable data input phase DMA management</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAOUTEN</name>
              <description>Enable data output phase DMA management</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCMPH</name>
              <description>GCM Phase</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHMOD_2</name>
              <description>AES Chaining Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEYSIZE</name>
              <description>Key size selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NPBLB</name>
              <description>Number of padding bytes in payload last block</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>AES status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCF</name>
              <description>Computation Complete Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDERR</name>
              <description>Read Error Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRERR</name>
              <description>Write Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DINR</name>
          <description>AES data input register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DINR</name>
              <description>AES Data Input Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTR</name>
          <description>AES data output register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DOUTR</name>
              <description>AES Data Output Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR0</name>
          <description>AES key register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR0</name>
              <description>AES Key Register 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR1</name>
          <description>AES key register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR1</name>
              <description>AES Key Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR2</name>
          <description>AES key register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR2</name>
              <description>AES Key Register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR3</name>
          <description>AES key register 3</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR3</name>
              <description>AES Key Register 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IVR0</name>
          <description>AES initialization vector register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVR0</name>
              <description>AES Initialization Vector Register 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IVR1</name>
          <description>AES initialization vector register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVR1</name>
              <description>AES Initialization Vector Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IVR2</name>
          <description>AES initialization vector register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVR2</name>
              <description>AES Initialization Vector Register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IVR3</name>
          <description>AES initialization vector register 3</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVR3</name>
              <description>AES Initialization Vector Register 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR4</name>
          <description>AES key register 4</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR4</name>
              <description>AES Key Register 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR5</name>
          <description>AES key register 5</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR5</name>
              <description>AES Key Register 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR6</name>
          <description>AES key register 6</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR6</name>
              <description>AES Key Register 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR7</name>
          <description>AES key register 7</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEYR7</name>
              <description>AES Key Register 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP0R</name>
          <description>AES Suspend register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP0R</name>
              <description>AES Suspend registers 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP1R</name>
          <description>AES Suspend register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP1R</name>
              <description>AES Suspend registers 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP2R</name>
          <description>AES Suspend register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP2R</name>
              <description>AES Suspend registers 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP3R</name>
          <description>AES Suspend register 3</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP3R</name>
              <description>AES Suspend registers 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP4R</name>
          <description>AES Suspend register 4</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP4R</name>
              <description>AES Suspend registers 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP5R</name>
          <description>AES Suspend register 5</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP5R</name>
              <description>AES Suspend registers 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP6R</name>
          <description>AES Suspend register 6</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP6R</name>
              <description>AES Suspend registers 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUSP7R</name>
          <description>AES Suspend register 7</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUSP7R</name>
              <description>AES Suspend registers 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
